Котельников_АБ_70153995/src/Documents/ОтказКандидату/ОтказКандидату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтказКандидату</name>
  <registerRecords>InformationRegister.СтатусыКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/AccumulationRegisters/КоличествоКандидатовПоЭтапам/КоличествоКандидатовПоЭтапам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КоличествоКандидатовПоЭтапам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзмененияЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Котельников_АБ_70153995/src/InformationRegisters/СтатусыКандидатов/СтатусыКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКандидатов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Котельников_АБ_70153995/src/Enums/ЭтапыПодбора/ЭтапыПодбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПодбора</name>
  <enumValues>
    <name>Неразобранные</name>
  </enumValues>
  <enumValues>
    <name>ПросмотрРезюме</name>
  </enumValues>
  <enumValues>
    <name>ТелефонноеИнтервью</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСобеседование</name>
  </enumValues>
  <enumValues>
    <name>СобеседованиеСИнициатором</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПринялПредложениеОРаботе</name>
  </enumValues>
  <enumValues>
    <name>КандидатОтказалсяОтПредложения</name>
  </enumValues>
  <enumValues>
    <name>ОтказКандидату</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/ОтказКандидату/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписатьДвиженияКоличествоКандидатовПоЭтапам();
	ЗаписатьДвиженияСтатусыКандидатов();
	
КонецПроцедуры

Процедура ЗаписатьДвиженияКоличествоКандидатовПоЭтапам()

	// регистр накопления КоличествоКандидатовПоЭтапам Приход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Этап = Перечисления.ЭтапыПодбора.ОтказКандидату;
	Движение.ЭтапПройден = Истина;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;

	// регистр накопления КоличествоКандидатовПоЭтапам Расход
	Движения.КоличествоКандидатовПоЭтапам.Записывать = Истина;
	Движение = Движения.КоличествоКандидатовПоЭтапам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	ДанныеПоследнегоЭтапа = ПолучитьПоследнийЭтапКандидата();
	Движение.Этап = ДанныеПоследнегоЭтапа.Этап;
	Движение.ЭтапПройден = ДанныеПоследнегоЭтапа.ЭтапПройден;
	Движение.ДатаИзмененияЭтапа = Дата;
	Движение.Количество = 1;

КонецПроцедуры

Функция ПолучитьПоследнийЭтапКандидата()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыКандидатовСрезПоследних.Статус КАК Статус,
		|	СтатусыКандидатовСрезПоследних.ЭтапПройден КАК ЭтапПройден
		|ИЗ
		|	РегистрСведений.СтатусыКандидатов.СрезПоследних(
		|			,
		|			Вакансия = &Вакансия
		|				И Кандидат = &Кандидат) КАК СтатусыКандидатовСрезПоследних";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Кандидат", Кандидат);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	ДанныеПоследнегоЭтапа = Новый Структура("Этап, ЭтапПройден", Выборка.Статус, Выборка.ЭтапПройден);

	Возврат ДанныеПоследнегоЭтапа;

КонецФункции

Процедура ЗаписатьДвиженияСтатусыКандидатов()

	// регистр сведений СтатусыКандидатов
	Движения.СтатусыКандидатов.Записывать = Истина;
	Движение = Движения.СтатусыКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.ЭтапПройден = Истина;
	Движение.Статус = Перечисления.ЭтапыПодбора.ОтказКандидату;

КонецПроцедуры
